cf/Catalogs/Профили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Профили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>чем выше тем мощнее (силище)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПрофилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НастройкиПрофилей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КартинкиОписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/ПрофилиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПрофилиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РедактированиеЦеныВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольВремениПосещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЧужихРазмещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьНовыйПарольПриВходе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРозничныйМагазин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idДиалогаТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КтоМожетПросматриватьСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиИнтернетПочты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Профили/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьФильтрСпискаПользователей(Ссылка)
	
	СписокПользователей.Параметры.УстановитьЗначениеПараметра("Профиль", Ссылка);
	
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьФильтрСпискаПользователей(Объект.Ссылка);
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ключ, Значение ИЗ Справочник.Профили.КартинкиОписания ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Структура = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Структура.Вставить(Выборка.Ключ, Выборка.Значение.Получить()); КонецЦикла; 
	
	Описание.УстановитьHTML(Объект.Описание, Структура);
			
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем Структура;
	
	Описание.ПолучитьHTML(ТекущийОбъект.Описание, Структура);
	ТекущийОбъект.КартинкиОписания.Очистить();
	
	Для Каждого Элемент Из Структура Цикл
		
		НовСтрока = ТекущийОбъект.КартинкиОписания.Добавить();
		НовСтрока.Ключ 		= Элемент.Ключ;
		НовСтрока.Значение 	= Новый ХранилищеЗначения(Элемент.Значение); КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//УстановитьФильтрСпискаПользователей(ТекущийОбъект.Ссылка);
	//Элементы.ГруппаСписок.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если 	ИмяСобытия = "СохраненыНастройкиПрофиля" И
			Параметр.Профиль = Объект.Ссылка Тогда
			
		//Закрыть(); 
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Функция ЗаписанИКрасавчег()
	
	Если Модифицированность И Элементы.СписокПользователей.ВыделенныеСтроки.Количество() Тогда
		ПоказатьПредупреждение(,"Сперва нужно записать");
		Возврат Ложь; КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
Функция МассивТекущегоПрофиля()
	
	Массив = Новый Массив;
	Массив.Добавить(Объект.Ссылка);
	
	Возврат Массив;
	
КонецФункции


&НаСервере
Функция УСтановитьПользователямПрофиль()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка Пользователь, &Профиль Профиль ИЗ Справочник.Пользователи Спр
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ПрофилиПользователей Рег
	|ПО
	|	Рег.Пользователь 	= Спр.Ссылка И
	|	Рег.Профиль 		= &Профиль
	|
	|ГДЕ Ссылка В(&Пользователи) И Рег.Пользователь ЕСТЬ NULL
	|");
	
	Запрос.УстановитьПараметр("Профиль", 		Объект.Ссылка);
	Запрос.УстановитьПараметр("Пользователи", 	Элементы.СписокПользователей.ВыделенныеСтроки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.ПрофилиПользователей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда
			Возврат Ложь; КонецЕсли; КонецЦикла;
	
	Возврат Истина;	
	
КонецФункции

&НаСервере
Функция ОбнулититьПользователейНаСервере()
	
	НачатьТранзакцию();
	
	Если 	УСтановитьПользователямПрофиль() И
			НастройкиПользователя.ОчиститьИУстановитьПрофилиПользователей(Элементы.СписокПользователей.ВыделенныеСтроки, МассивТекущегоПрофиля()) Тогда
			
		ЗафиксироватьТранзакцию();
		Возврат Истина; КонецЕсли;
	
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции
&НаКлиенте
Процедура ОбнулититьПользователей(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да И ОбнулититьПользователейНаСервере() Тогда
		ПоказатьОповещениеПользователя("Настройки выбранных пользователей сброшены и установлены из профиля: " + Объект.Наименование,,"Обнуление пользователей"); 
		Закрыть(); КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ДобавитьНастройкиПользователямНаСервере()
	
	НачатьТранзакцию();
	
	Если 	УСтановитьПользователямПрофиль() И
			НастройкиПользователя.УстановитьПрофилиНаПользователей(Элементы.СписокПользователей.ВыделенныеСтроки, МассивТекущегоПрофиля()) Тогда
			
		ЗафиксироватьТранзакцию();
		Возврат Истина; КонецЕсли;
	
	ОтменитьТранзакцию();
	Возврат Ложь; 
	
КонецФункции
&НаКлиенте
Процедура ДобавитьНастройкиПользователям(Ответ, ДопПараметр) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да И ДобавитьНастройкиПользователямНаСервере() Тогда
		ПоказатьОповещениеПользователя("Добавлены выбранным пользователям настройки из профиля: " + Объект.Наименование,,"Обновление настроек пользователей"); 
		Закрыть(); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоверх(Команда)
	
	Если ЗаписанИКрасавчег() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьНастройкиПользователям", ЭтаФорма), "Добавить выбранным пользователям настройки этого профиля??", РежимДиалогаВопрос.ДаНет) КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОчиститьИУстановить(Команда)
	
	Если ЗаписанИКрасавчег() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбнулититьПользователей", ЭтаФорма), "Будут очищены все настройки выбранных пользователе и назначены только из этого профиля, Продожить?", РежимДиалогаВопрос.ДаНет) КонецЕсли;
	
КонецПроцедуры
